// Деривованные запросы к сущности "ВерсияПакета": только заглушки &МетодЗапроса, тела строит autumn-data.
// Контракт каждого метода задан его именем; прикладной вход — фасад ХранилищеВерсийПакета.

// BSLLS:UnusedParameters-off

&Родитель
Перем ХранилищеСущностей;

&МетодЗапроса
Функция ПолучитьОдноПоИдентификаторРавно(Идентификатор) Экспорт
	Возврат Неопределено;
КонецФункции

&МетодЗапроса
Функция ПолучитьПоПакетИдентификаторРавно(ПакетИдентификатор) Экспорт
	Возврат Неопределено;
КонецФункции

&МетодЗапроса
Функция ПолучитьПоПакетИдентификаторВ(ПакетИдентификаторы) Экспорт
	Возврат Неопределено;
КонецФункции

&МетодЗапроса
Функция ПолучитьОдноПоПакетИдентификаторРавноИВерсияРавно(ПакетИдентификатор, Версия) Экспорт
	Возврат Неопределено;
КонецФункции

&МетодЗапроса
Функция ПолучитьПоПакетИдентификаторРавноИОтозванаРавно(ПакетИдентификатор, Отозвана) Экспорт
	Возврат Неопределено;
КонецФункции

&МетодЗапроса
Функция ПолучитьПоОпубликовалИдентификаторРавно(ОпубликовалИдентификатор) Экспорт
	Возврат Неопределено;
КонецФункции

&МетодЗапроса
Функция ПолучитьПервыеУпорядочитьПоОпубликованаУбывИдентификаторУбыв(Лимит) Экспорт
	Возврат Неопределено;
КонецФункции


&ХранилищеСущностей("ВерсияПакета")
Процедура ПриСозданииОбъекта()
КонецПроцедуры
