// Тело записи тега пакета: ручной тег либо тег по правилу.

&Сериализуемое("mode")
&Тип("Строка")
Перем Режим;

&Сериализуемое("rule")
&Тип("Строка")
Перем Правило;

&Сериализуемое("ruleType")
&Тип("Строка")
&ОдинИз("semver", "regex")
Перем ТипПравила;

&Сериализуемое("version")
&Тип("Строка")
Перем Версия;

&Сериализуемое("default")
&Тип("Булево")
Перем ПоУмолчанию;

&Сериализуемое("overwrite_allowed")
&Тип("Булево")
Перем ПерезаписьРазрешена;

&Сериализуемое("style")
&Тип("Строка")
Перем Стиль;

&Сериализуемое("icon")
&Тип("Строка")
Перем Значок;
