// Теги пакета и выключенные у него теги пула.

&Сериализуемое("tags")
&Заполнено
&Тип("Массив")
&ДляКаждого("Значение")
&Тип("ТегПакетаJSON")
Перем Теги;

&Сериализуемое("page")
&Заполнено
&Тип("Число")
Перем Номер;

&Сериализуемое("pageSize")
&Заполнено
&Тип("Число")
Перем Размер;

&Сериализуемое("total")
&Заполнено
&Тип("Число")
Перем Всего;

&Сериализуемое("has_more")
&Заполнено
&Тип("Булево")
Перем ЕстьЕщё;

&Сериализуемое("disabled")
&Заполнено
&Тип("Массив")
&ДляКаждого("Значение")
&Тип("Строка")
Перем ВыключенныеТегиПула;
