// Заявка на публикацию во входящих пула.

&Сериализуемое("id")
&Заполнено
&Тип("Число")
Перем Ид;

&Сериализуемое("pool")
&Заполнено
&Тип("Строка")
Перем Пул;

&Сериализуемое("package")
&Заполнено
&Тип("Строка")
Перем Пакет;

&Сериализуемое("version")
&Заполнено
&Тип("Строка")
Перем Версия;

&Сериализуемое("applicant")
&Заполнено
&Тип("Строка")
Перем Заявитель;

&Сериализуемое("manifest_author")
&Заполнено
&Тип("Строка")
Перем АвторПоМанифесту;

&Сериализуемое("channel")
&Заполнено
&Тип("Строка")
Перем Канал;

&Сериализуемое("file_name")
&Заполнено
&Тип("Строка")
Перем ИмяФайла;

&Сериализуемое("size")
&Заполнено
&Тип("Число")
Перем Размер;

&Сериализуемое("sha256")
&Заполнено
&Тип("Строка")
Перем SHA256;

&Сериализуемое("state")
&Заполнено
&Тип("Строка")
&ОдинИз("ожидает", "одобрена", "отклонена")
Перем Состояние;

&Сериализуемое("created")
&Заполнено
&Тип("Строка")
Перем Создана;

&Сериализуемое("manifest")
&Тип("МанифестЗаявкиJSON")
Перем Манифест;
